# Brewfile
# brew bundle dump

# For firefox-nightly
tap "homebrew/cask-versions"
# For yabai and skhd
tap "koekeishiya/formulae"

brew "ack"
brew "coreutils"
brew "curl"
brew "ffmpeg"
brew "findutils"
brew "git"
brew "gnu-sed"
brew "imagemagick"
brew "moreutils"
brew "ngrep"
brew "p7zip"
brew "python"
brew "ruby"
brew "telnet"
brew "tmux"
brew "tree"
brew "unrar"
brew "wget"
brew "zsh"

# personal
brew "bottom" # btm
brew "jq"
brew "neovim"

# MAMP Things (see mamp.sh)
# brew "dnsmasq", restart_service: true
# brew "mysql", restart_service: true, link: false

# Swift
brew "swiftlint"

# JS
brew "n"

# GPG
brew "gnupg"
brew "pinentry-mac"

# Window Manager
brew "skhd"
brew "yabai"

# fun
brew "cmatrix"
brew "figlet"
brew "fortune"
brew "lolcat"
brew "megatools"
brew "mitmproxy"
brew "neofetch"
brew "nmap"
brew "pfetch"
brew "youtube-dl"

# Casks
cask "android-file-transfer"
cask "android-studio"
# cask "arduino"
cask "balenaetcher"
# cask "bettertouchtool"
# cask "calibre"
# cask "cyberduck"
# cask "discord"
# cask "dropbox"
cask "ghostty"
# cask "gimp"
# cask "inkscape"
cask "itsycal"
cask "keka"
# cask "keybase"
cask "lagrange"
cask "librewolf"
cask "obsidian"
cask "sequel-ace"
cask "slack"
cask "soduto"
cask "syncthing"
cask "thunderbird"
# cask "tor-browser"
# cask "virtualbox"
cask "vlc"
cask "vscodium"

# Fonts
tap "homebrew/cask-fonts"
cask "font-fira-mono-for-powerline"
cask "font-hack"
