# Brewfile

# For firefox-nightly
tap "homebrew/cask-versions"
# For yabai and skhd
tap "koekeishiya/formulae"

brew "ack"
brew "coreutils"
brew "curl"
brew "exiftool"
brew "ffmpeg"
brew "findutils"
brew "git"
brew "gnu-sed"
brew "imagemagick"
brew "irssi"
brew "moreutils"
brew "ngrep"
brew "p7zip"
brew "python"
brew "ruby"
brew "telnet"
brew "tmux"
brew "tree"
brew "unrar"
brew "wget"
brew "zsh"

# VIM
# brew "vim"
brew "neovim"

# MAMP Things (see mamp.sh)
# brew "dnsmasq", restart_service: true
# brew "mysql", restart_service: true, link: false

# Swift
brew "swiftlint"

# JS
brew "n"
# brew "yarn"

# DENO
brew "deno"

# Go
brew "go"

# Window Manager
brew "skhd", restart_service: true
brew "yabai", restart_service: true
brew "jq"

# GPG
brew "gnupg"
brew "pinentry-mac"

# fun
brew "cmatrix"
brew "figlet"
brew "fortune"
brew "lolcat"
brew "megatools"
brew "mitmproxy"
brew "neofetch"
brew "nmap"
brew "pfetch"
brew "youtube-dl"

# Testing
brew "btop"

# Casks
cask "alacritty"
cask "android-file-transfer"
cask "android-studio"
# cask "arduino"
cask "balenaetcher"
# cask "bettertouchtool"
cask "brave-browser"
# cask "calibre"
# cask "cyberduck"
# cask "discord"
# cask "docker"
# cask "dropbox"
cask "firefox-nightly"
# cask "gimp"
cask "google-chrome"
cask "insomnia"
cask "keka"
# cask "keybase"
cask "sequel-ace"
cask "slack"
cask "thunderbird"
# cask "virtualbox"
cask "visual-studio-code"
cask "vlc"

# Fonts
tap "homebrew/cask-fonts"
cask "font-fira-mono-for-powerline"
cask "font-hack"
