# Brewfile

# For firefox-nightly
tap "caskroom/versions"
# For chunkwm
tap "koekeishiya/formulae"

brew "ack"
brew "coreutils"
brew "curl"
brew "dnsmasq", restart_service: true
brew "libevent"
brew "findutils"
brew "git"
brew "gnu-sed"
brew "moreutils"
brew "mysql", restart_service: true, link: false
brew "n"
brew "ngrep"
brew "p7zip"
brew "python"
brew "ruby"
brew "telnet"
brew "tmux"
brew "tree"
brew "unrar"
brew "vim"
brew "wget"
brew "zsh"

# Window Manager
brew "chunkwm"
brew "skhd"

# GPG
brew "gnupg"
brew "pinentry-mac"

# fun
brew "cmatrix"
brew "figlet"
brew "fortune"
brew "greed"
brew "lolcat"
brew "megatools"
brew "mitmproxy"
brew "neofetch"
brew "nmap"

# Testing
brew "fff"

# Casks
cask "alacritty"
# cask "android-file-transfer"
# cask "android-studio"
# cask "arduino"
cask "balenaetcher"
# cask "bettertouchtool"
cask "bitbar"
cask "brave-browser"
# cask "calibre"
cask "cyberduck"
# cask "discord"
# cask "docker"
cask "dropbox"
cask "firefox-nightly"
# cask "gimp"
cask "google-chrome"
# cask "insomnia"
# cask "java"
cask "keybase"
cask "slack"
# cask "spotify"
# cask "steam"
cask "the-unarchiver"
cask "thunderbird"
# cask "virtualbox"
cask "visual-studio-code"
cask "vlc"

# Testing
cask "ngrok"

# Fonts
tap "caskroom/fonts"
cask "caskroom/fonts/font-fira-mono"
cask "caskroom/fonts/font-fira-mono-for-powerline"
cask "caskroom/fonts/font-hack"
